# series
## series的创建

In [2]:
import pandas as pd
import numpy as np

In [4]:
pd.Series(np.arange(9))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
dtype: int64

In [5]:
pd.Series([1.2, 2.3, 4.5, 5.0], index=[1, 2, 3, 4])

1    1.2
2    2.3
3    4.5
4    5.0
dtype: float64

In [8]:
color_count = pd.Series({"red":10, "green":20, "blue":100})

In [9]:
color_count

blue     100
green     20
red       10
dtype: int64

## series的属性

In [10]:
color_count.index

Index(['blue', 'green', 'red'], dtype='object')

In [11]:
color_count.values

array([100,  20,  10])

In [12]:
color_count[0]

100

In [13]:
color_count[1]

20

# DataFrame
## DataFrame创建

In [14]:
pd.DataFrame(np.random.randn(2,3))

          0         1         2
0  1.434003  0.715434 -1.066398
1  0.069269 -0.477732 -0.911352

In [15]:
score = np.random.randint(40, 100, (10, 5))

In [16]:
score

array([[98, 85, 84, 93, 83],
       [73, 68, 64, 47, 87],
       [91, 58, 86, 92, 46],
       [62, 86, 99, 75, 66],
       [49, 73, 46, 61, 81],
       [43, 96, 47, 65, 90],
       [98, 84, 60, 73, 54],
       [59, 93, 58, 83, 43],
       [62, 66, 51, 88, 89],
       [66, 60, 63, 57, 51]])

In [17]:
score_df = pd.DataFrame(score)

In [18]:
score_df

    0   1   2   3   4
0  98  85  84  93  83
1  73  68  64  47  87
2  91  58  86  92  46
3  62  86  99  75  66
4  49  73  46  61  81
5  43  96  47  65  90
6  98  84  60  73  54
7  59  93  58  83  43
8  62  66  51  88  89
9  66  60  63  57  51

In [21]:
subjects = ["语文", "数学", "英语", "政治", "体育"]

stu = ["同学"+ str(i) for i in range(score_df.shape[0])]

data = pd.DataFrame(score, columns=subjects, index=stu)

In [20]:
stu

['同学0', '同学1', '同学2', '同学3', '同学4', '同学5', '同学6', '同学7', '同学8', '同学9']

In [22]:
data

     语文  数学  英语  政治  体育
同学0  98  85  84  93  83
同学1  73  68  64  47  87
同学2  91  58  86  92  46
同学3  62  86  99  75  66
同学4  49  73  46  61  81
同学5  43  96  47  65  90
同学6  98  84  60  73  54
同学7  59  93  58  83  43
同学8  62  66  51  88  89
同学9  66  60  63  57  51

## DataFrame的属性

In [23]:
data.shape

(10, 5)

In [24]:
data.index

Index(['同学0', '同学1', '同学2', '同学3', '同学4', '同学5', '同学6', '同学7', '同学8', '同学9'], dtype='object')

In [25]:
data.columns

Index(['语文', '数学', '英语', '政治', '体育'], dtype='object')

In [26]:
data.values

array([[98, 85, 84, 93, 83],
       [73, 68, 64, 47, 87],
       [91, 58, 86, 92, 46],
       [62, 86, 99, 75, 66],
       [49, 73, 46, 61, 81],
       [43, 96, 47, 65, 90],
       [98, 84, 60, 73, 54],
       [59, 93, 58, 83, 43],
       [62, 66, 51, 88, 89],
       [66, 60, 63, 57, 51]])

In [27]:
data.T

    同学0  同学1  同学2  同学3  同学4  同学5  同学6  同学7  同学8  同学9
语文   98   73   91   62   49   43   98   59   62   66
数学   85   68   58   86   73   96   84   93   66   60
英语   84   64   86   99   46   47   60   58   51   63
政治   93   47   92   75   61   65   73   83   88   57
体育   83   87   46   66   81   90   54   43   89   51

In [29]:
data

     语文  数学  英语  政治  体育
同学0  98  85  84  93  83
同学1  73  68  64  47  87
同学2  91  58  86  92  46
同学3  62  86  99  75  66
同学4  49  73  46  61  81
同学5  43  96  47  65  90
同学6  98  84  60  73  54
同学7  59  93  58  83  43
同学8  62  66  51  88  89
同学9  66  60  63  57  51

In [28]:
data.head()

     语文  数学  英语  政治  体育
同学0  98  85  84  93  83
同学1  73  68  64  47  87
同学2  91  58  86  92  46
同学3  62  86  99  75  66
同学4  49  73  46  61  81

In [30]:
data.head(3)

     语文  数学  英语  政治  体育
同学0  98  85  84  93  83
同学1  73  68  64  47  87
同学2  91  58  86  92  46

In [31]:
data.tail(3)

     语文  数学  英语  政治  体育
同学7  59  93  58  83  43
同学8  62  66  51  88  89
同学9  66  60  63  57  51

## DataFrame索引值的设置

In [33]:
stu = ["同学_"+ str(i) for i in range(score_df.shape[0])]